In [1]:
import pandas as pd
pd.set_option("display.max.columns", None)

In [2]:
pd.set_option("display.max.rows", 6)

# Concatenating Data

## Concatenate Two or More Pandas DataFrames Over Index

In [3]:
import pandas as pd

# Creating Dataframe A
store_a = {'Product': ['Product A', 'Product B'],
           'Qty Sold (Units)': [2000, 1000],
           'Price per Unit': [5, 7],
           'Total Revenue ($)': [10000, 7000]}
store_a_df = pd.DataFrame(store_a)

In [4]:
# Creating Dataframe B
store_b = {'Product': ['Product A', 'Product B'],
           'Qty Sold (Units)': [1000, 500],
           'Price per Unit': [5, 7],
           'Total Revenue ($)': [5000, 3500],
           #'Profit ($)': [1000, 500]
          }
store_b_df = pd.DataFrame(store_b)

In [5]:
store_a_df

     Product  Qty Sold (Units)  Price per Unit  Total Revenue ($)
0  Product A              2000               5              10000
1  Product B              1000               7               7000

In [6]:
store_b_df

     Product  Qty Sold (Units)  Price per Unit  Total Revenue ($)
0  Product A              1000               5               5000
1  Product B               500               7               3500

In [7]:
concatenated_df = pd.concat([store_a_df, store_b_df])
concatenated_df

     Product  Qty Sold (Units)  Price per Unit  Total Revenue ($)
0  Product A              2000               5              10000
1  Product B              1000               7               7000
0  Product A              1000               5               5000
1  Product B               500               7               3500

###### Clear the existing index and reset it in the result

Clear the existing index and reset it in the result by setting the ignore_index option to True

In [8]:
frame = [store_a_df, store_b_df]
concatenated_df = pd.concat(frame, ignore_index=True)
concatenated_df

     Product  Qty Sold (Units)  Price per Unit  Total Revenue ($)
0  Product A              2000               5              10000
1  Product B              1000               7               7000
2  Product A              1000               5               5000
3  Product B               500               7               3500

Suppose we wanted to associate specific keys with each of the pieces of the chopped up DataFrame. We can do this using the keys argument:

In [9]:
frame = [store_a_df, store_b_df]
keys = ['store_a', 'store_b']

concatenated_df = pd.concat(frame, keys=keys)
concatenated_df

             Product  Qty Sold (Units)  Price per Unit  Total Revenue ($)
store_a 0  Product A              2000               5              10000
        1  Product B              1000               7               7000
store_b 0  Product A              1000               5               5000
        1  Product B               500               7               3500

In [10]:
concatenated_df.loc['store_a']

     Product  Qty Sold (Units)  Price per Unit  Total Revenue ($)
0  Product A              2000               5              10000
1  Product B              1000               7               7000

In [11]:
concatenated_df.loc['store_b']

     Product  Qty Sold (Units)  Price per Unit  Total Revenue ($)
0  Product A              1000               5               5000
1  Product B               500               7               3500

###### Concatenating DataFrames with Mixed Columns

In [12]:
import pandas as pd

# Creating Dataframe A
store_a = {'Product': ['Product A', 'Product B'],
           'Qty Sold (Units)': [2000, 1000],
           'Price per Unit': [5, 7],
           'Total Revenue ($)': [10000, 7000]}
store_a_df = pd.DataFrame(store_a)

In [13]:
# Creating Dataframe B
store_b = {'Product': ['Product A', 'Product B'],
           'Qty Sold (Units)': [1000, 500],
           'Price per Unit': [5, 7],
           'Total Revenue ($)': [5000, 3500],
           'Profit ($)': [1000, 500]
          }
store_b_df = pd.DataFrame(store_b)

In [14]:
store_a_df

     Product  Qty Sold (Units)  Price per Unit  Total Revenue ($)
0  Product A              2000               5              10000
1  Product B              1000               7               7000

In [15]:
store_b_df

     Product  Qty Sold (Units)  Price per Unit  Total Revenue ($)  Profit ($)
0  Product A              1000               5               5000        1000
1  Product B               500               7               3500         500

In [16]:
concatenated_df = pd.concat([store_a_df, store_b_df])
concatenated_df

     Product  Qty Sold (Units)  Price per Unit  Total Revenue ($)  Profit ($)
0  Product A              2000               5              10000         NaN
1  Product B              1000               7               7000         NaN
0  Product A              1000               5               5000      1000.0
1  Product B               500               7               3500       500.0

In [17]:
concatenated_df = pd.concat([store_a_df, store_b_df],
                           join='inner')
concatenated_df

     Product  Qty Sold (Units)  Price per Unit  Total Revenue ($)
0  Product A              2000               5              10000
1  Product B              1000               7               7000
0  Product A              1000               5               5000
1  Product B               500               7               3500

## Concatenate Two or More Pandas DataFrames horizontally

You can also merge columns across the columns using the axis = 1

In [18]:
import pandas as pd
df1 = pd.DataFrame({'Store': ['Store A', 'Store B', 'Store C'],
                    'January Sales': [100, 120, 90],
                    'February Sales': [120, 100, 95]})

In [19]:
df2 = pd.DataFrame({'Store': ['Store A', 'Store B', 'Store C'],
                    'March Sales': [110, 130, 100],
                    'April Sales': [130, 110, 105]})

In [20]:
df1

     Store  January Sales  February Sales
0  Store A            100             120
1  Store B            120             100
2  Store C             90              95

In [21]:
df2

     Store  March Sales  April Sales
0  Store A          110          130
1  Store B          130          110
2  Store C          100          105

In [22]:
combined_df = pd.concat([df1, df2], axis=1)

In [23]:
combined_df

     Store  January Sales  February Sales    Store  March Sales  April Sales
0  Store A            100             120  Store A          110          130
1  Store B            120             100  Store B          130          110
2  Store C             90              95  Store C          100          105

# Merging Data

In [24]:
df1 = pd.DataFrame({'Product ID': [12345, 23456, 34567],
                   'Sales Amount': [100, 150, 200],
                   'Discount Percent': [0.10, 0.20, 0.30]})

df2 = pd.DataFrame({'Product ID': [12345, 23456, 34567],
                   'Product Name': ['Bicycle', 'Pants', 'Shoes'],
                   'Product Category': ['Sports', 'Clothing', 'Clothing']})

In [25]:
df1

   Product ID  Sales Amount  Discount Percent
0       12345           100               0.1
1       23456           150               0.2
2       34567           200               0.3

In [26]:
df2

   Product ID Product Name Product Category
0       12345      Bicycle           Sports
1       23456        Pants         Clothing
2       34567        Shoes         Clothing

In [27]:
df_merged = pd.merge(df1, df2, on='Product ID')
df_merged

   Product ID  Sales Amount  Discount Percent Product Name Product Category
0       12345           100               0.1      Bicycle           Sports
1       23456           150               0.2        Pants         Clothing
2       34567           200               0.3        Shoes         Clothing

In [28]:
df1 = pd.DataFrame({'Product ID': [12345, 23456, 34567],
                   'Sales Amount': [100, 150, 200],
                   'Discount Percent': [0.10, 0.20, 0.30]})

df2 = pd.DataFrame({'Product#': [12345, 23456, 34567],
                   'Product Name': ['Bicycle', 'Pants', 'Shoes'],
                   'Product Category': ['Sports', 'Clothing', 'Clothing']})

In [29]:
df1

   Product ID  Sales Amount  Discount Percent
0       12345           100               0.1
1       23456           150               0.2
2       34567           200               0.3

In [30]:
df2

   Product# Product Name Product Category
0     12345      Bicycle           Sports
1     23456        Pants         Clothing
2     34567        Shoes         Clothing

In [31]:
df_merged = pd.merge(df1, df2, 
                     left_on='Product ID',
                     right_on='Product#'  )
df_merged

,Product ID,Sales Amount,Discount Percent,Product#,Product Name,Product Category
0,12345,100,0.1,12345,Bicycle,Sports
1,23456,150,0.2,23456,Pants,Clothing
2,34567,200,0.3,34567,Shoes,Clothing

In [32]:
df1 = pd.DataFrame({'Product ID': [12345, 23456, 34567, 98761],
                   'Sales Amount': [100, 150, 200, 203],
                   'Discount Percent': [0.10, 0.20, 0.30, 0.21]})

df2 = pd.DataFrame({'Product ID': [12345, 23456, 34567, 56321],
                   'Product Name': ['Bicycle', 'Pants', 'Shoes', 'Computer'],
                   'Product Category': ['Sports', 'Clothing', 'Clothing', 'Electronics']})

In [33]:
df1

   Product ID  Sales Amount  Discount Percent
0       12345           100              0.10
1       23456           150              0.20
2       34567           200              0.30
3       98761           203              0.21

In [34]:
df2

   Product ID Product Name Product Category
0       12345      Bicycle           Sports
1       23456        Pants         Clothing
2       34567        Shoes         Clothing
3       56321     Computer      Electronics

In [35]:
df_merged = pd.merge(df1, df2, 
                     on='Product ID',
                     )
df_merged

   Product ID  Sales Amount  Discount Percent Product Name Product Category
0       12345           100               0.1      Bicycle           Sports
1       23456           150               0.2        Pants         Clothing
2       34567           200               0.3        Shoes         Clothing

By default, Pandas will complete an inner join.

###### Merge Type outer join
If we changed the how= parameter to `'outer'`, then all records from both datasets would be included:

In [36]:
df_merged = pd.merge(df1, df2, 
                     on='Product ID',
                     how='outer'
                     )
df_merged

   Product ID  Sales Amount  Discount Percent Product Name Product Category
0       12345         100.0              0.10      Bicycle           Sports
1       23456         150.0              0.20        Pants         Clothing
2       34567         200.0              0.30        Shoes         Clothing
3       98761         203.0              0.21          NaN              NaN
4       56321           NaN               NaN     Computer      Electronics

###### Merge Type left join
If we changed the how= parameter to `'left'`, then all records from left datasets would be included:

In [37]:
df_merged = pd.merge(df1, df2, 
                     on='Product ID',
                     how='left'
                     )
df_merged

   Product ID  Sales Amount  Discount Percent Product Name Product Category
0       12345           100              0.10      Bicycle           Sports
1       23456           150              0.20        Pants         Clothing
2       34567           200              0.30        Shoes         Clothing
3       98761           203              0.21          NaN              NaN

###### Merge Type right join
If we changed the how= parameter to `'right'`, then all records from right datasets would be included:

In [38]:
df_merged = pd.merge(df1, df2, 
                     on='Product ID',
                     how='right'
                     )
df_merged

   Product ID  Sales Amount  Discount Percent Product Name Product Category
0       12345         100.0               0.1      Bicycle           Sports
1       23456         150.0               0.2        Pants         Clothing
2       34567         200.0               0.3        Shoes         Clothing
3       56321           NaN               NaN     Computer      Electronics

###### Merging Pandas DataFrames on index

In [39]:
import pandas as pd

df1 = pd.DataFrame({'product': ['Phone', 'Laptop', 'TV'],
                   'sales': [100, 200, 300]},
                  index=[0, 1, 2])

df2 = pd.DataFrame({'product': ['Phone', 'Laptop', 'TV'],
                   'price': [50, 100, 150]},
                  index=[0, 1, 2])

In [40]:
df1

  product  sales
0   Phone    100
1  Laptop    200
2      TV    300

In [41]:
df2

  product  price
0   Phone     50
1  Laptop    100
2      TV    150

In [42]:
df_merged = df1.merge(df2, left_index=True, right_index=True)

In [43]:
df_merged

  product_x  sales product_y  price
0     Phone    100     Phone     50
1    Laptop    200    Laptop    100
2        TV    300        TV    150

# Joining - Combining Data on a Column or Index

While `merge()` is a module function, `.join()` is an instance method that lives on your DataFrame. This enables you to specify only one DataFrame, which will join the DataFrame you call `.join()` on.

In [44]:
df1 = pd.DataFrame({'Product ID': [12345, 23456, 34567, 98761],
                   'Sales Amount': [100, 150, 200, 203],
                   'Discount Percent': [0.10, 0.20, 0.30, 0.21]})

df2 = pd.DataFrame({'Product ID': [12345, 23456, 34567, 56321],
                   'Product Name': ['Bicycle', 'Pants', 'Shoes', 'Computer'],
                   'Product Category': ['Sports', 'Clothing', 'Clothing', 'Electronics']})

In [45]:
df1

   Product ID  Sales Amount  Discount Percent
0       12345           100              0.10
1       23456           150              0.20
2       34567           200              0.30
3       98761           203              0.21

In [46]:
df2

   Product ID Product Name Product Category
0       12345      Bicycle           Sports
1       23456        Pants         Clothing
2       34567        Shoes         Clothing
3       56321     Computer      Electronics

In [47]:
df_merged = pd.merge(df1, df2, 
                     on='Product ID',
                     )
df_merged

   Product ID  Sales Amount  Discount Percent Product Name Product Category
0       12345           100               0.1      Bicycle           Sports
1       23456           150               0.2        Pants         Clothing
2       34567           200               0.3        Shoes         Clothing

In [48]:
try:
    df_join = df1.join(df2)
except Exception as e:
    print("An error occurred:", type(e).__name__, "", e)

An error occurred: ValueError  columns overlap but no suffix specified: Index(['Product ID'], dtype='object')

In [49]:
df_join = df1.join(df2,lsuffix='_left',rsuffix='_right')

In [50]:
df_join

,Product ID_left,Sales Amount,Discount Percent,Product ID_right,Product Name,Product Category
0,12345,100,0.10,12345,Bicycle,Sports
1,23456,150,0.20,23456,Pants,Clothing
2,34567,200,0.30,34567,Shoes,Clothing
3,98761,203,0.21,56321,Computer,Electronics

In [51]:
df1

   Product ID  Sales Amount  Discount Percent
0       12345           100              0.10
1       23456           150              0.20
2       34567           200              0.30
3       98761           203              0.21

In [52]:
df2 = df2.set_index('Product ID')
df2

           Product Name Product Category
Product ID
12345           Bicycle           Sports
23456             Pants         Clothing
34567             Shoes         Clothing
56321          Computer      Electronics

In [53]:
df_join = df1.join(df2,on='Product ID')

In [54]:
df_join

   Product ID  Sales Amount  Discount Percent Product Name Product Category
0       12345           100              0.10      Bicycle           Sports
1       23456           150              0.20        Pants         Clothing
2       34567           200              0.30        Shoes         Clothing
3       98761           203              0.21          NaN              NaN

In [55]:
df_join = df1.join(df2,on='Product ID',how='inner')

In [56]:
df_join

   Product ID  Sales Amount  Discount Percent Product Name Product Category
0       12345           100               0.1      Bicycle           Sports
1       23456           150               0.2        Pants         Clothing
2       34567           200               0.3        Shoes         Clothing

In [57]:
df_join = df1.join(df2,on='Product ID',how='outer')

In [58]:
df_join

     Product ID  Sales Amount  Discount Percent Product Name Product Category
0.0       12345         100.0              0.10      Bicycle           Sports
1.0       23456         150.0              0.20        Pants         Clothing
2.0       34567         200.0              0.30        Shoes         Clothing
3.0       98761         203.0              0.21          NaN              NaN
NaN       56321           NaN               NaN     Computer      Electronics

In [59]:
df_join = df1.join(df2,on='Product ID',how='right')

In [60]:
df_join

     Product ID  Sales Amount  Discount Percent Product Name Product Category
0.0       12345         100.0               0.1      Bicycle           Sports
1.0       23456         150.0               0.2        Pants         Clothing
2.0       34567         200.0               0.3        Shoes         Clothing
NaN       56321           NaN               NaN     Computer      Electronics

In [61]:
df1.set_index("Product ID",inplace=True)
df1

            Sales Amount  Discount Percent
Product ID
12345                100              0.10
23456                150              0.20
34567                200              0.30
98761                203              0.21

In [62]:
df2

           Product Name Product Category
Product ID
12345           Bicycle           Sports
23456             Pants         Clothing
34567             Shoes         Clothing
56321          Computer      Electronics

In [63]:
df_join = df1.join(df2)

In [64]:
df_join

            Sales Amount  Discount Percent Product Name Product Category
Product ID
12345                100              0.10      Bicycle           Sports
23456                150              0.20        Pants         Clothing
34567                200              0.30        Shoes         Clothing
98761                203              0.21          NaN              NaN

In [65]:
df_join = df1.join(df2,on='Product ID')

In [66]:
df_join

            Sales Amount  Discount Percent Product Name Product Category
Product ID
12345                100              0.10      Bicycle           Sports
23456                150              0.20        Pants         Clothing
34567                200              0.30        Shoes         Clothing
98761                203              0.21          NaN              NaN

In [67]:
df_join = df1.join(df2,on='Product ID',how='inner')

In [68]:
df_join

            Sales Amount  Discount Percent Product Name Product Category
Product ID
12345                100               0.1      Bicycle           Sports
23456                150               0.2        Pants         Clothing
34567                200               0.3        Shoes         Clothing

In [69]:
df_join = df1.join(df2,on='Product ID',how='outer')

In [70]:
df_join

,Product ID,Sales Amount,Discount Percent,Product Name,Product Category
12345.0,12345,100.0,0.10,Bicycle,Sports
23456.0,23456,150.0,0.20,Pants,Clothing
34567.0,34567,200.0,0.30,Shoes,Clothing
98761.0,98761,203.0,0.21,NaN,NaN
NaN,56321,NaN,NaN,Computer,Electronics

In [71]:
df_join = df1.join(df2,on='Product ID',how='right')

In [72]:
df_join

,Product ID,Sales Amount,Discount Percent,Product Name,Product Category
12345.0,12345,100.0,0.1,Bicycle,Sports
23456.0,23456,150.0,0.2,Pants,Clothing
34567.0,34567,200.0,0.3,Shoes,Clothing
NaN,56321,NaN,NaN,Computer,Electronics